SuhasMruthunjaya/SuhasMruthunjaya/Fromm_CAR_Project_sourcecodes/Car_Autonomous_Fromm_Moodle/80_Car_Drive_Autonomous.cydsn/Generated_Source/PSoC5/Engine_Direction_RR.h
/*******************************************************************************
* File Name: Engine_Direction_RR.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Engine_Direction_RR_H) /* CY_CONTROL_REG_Engine_Direction_RR_H */
#define CY_CONTROL_REG_Engine_Direction_RR_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Engine_Direction_RR_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Engine_Direction_RR_Write(uint8 control) ;
uint8   Engine_Direction_RR_Read(void) ;

void Engine_Direction_RR_SaveConfig(void) ;
void Engine_Direction_RR_RestoreConfig(void) ;
void Engine_Direction_RR_Sleep(void) ; 
void Engine_Direction_RR_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Engine_Direction_RR_Control        (* (reg8 *) Engine_Direction_RR_Sync_ctrl_reg__CONTROL_REG )
#define Engine_Direction_RR_Control_PTR    (  (reg8 *) Engine_Direction_RR_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Engine_Direction_RR_H */


/* [] END OF FILE */
